aws_region      = "us-east-2"
aws_shot_region = "ue2"
environment     = "net"
service_name    = "naemo"

public_domain          = "naemo.io"
dev_public_domain      = "dev.naemo.io"
dev_next_public_domain = "dev-next.naemo.io"
stg_public_domain      = "stg.naemo.io"
nprd_public_domain     = "nprd.naemo.io"
domain                 = "mgmt.net.naemo.io"
homepage_domain        = "bithumbmeta.io"
homepage_domain_xyz    = "bithumbmeta.xyz"
homepage_domain_org    = "bithumbmeta.org"
homepage_domain_net    = "bithumbmeta.net"
homepage_domain_kr     = "bithumbmeta.kr"
homepage_domain_cokr   = "bithumbmeta.co.kr"

##### TEMP Configuration #######
exception_ip_list = ["3.35.94.22/32",
  "115.139.141.70/32", "3.37.77.148/32",
  "182.229.60.83/32", "218.153.169.217/32",
  "112.145.201.232/32", "122.46.241.216/32", "211.109.161.71/32", "125.177.192.12/32",
  "14.7.32.72/32", "119.196.89.245/32", "49.173.8.205/32",
  "110.13.234.153/32", ## Mia
  "220.79.175.39/32",
  "188.241.81.172/32", ## aleksandr.radevic
  "81.2.157.218/32",   ## Harnek Sandhar
  "119.70.25.131/32", "220.93.4.62/32",
  "125.240.93.154/32", "182.55.75.134/32", "95.91.247.28/32", "220.85.230.88/32", "188.120.85.217/32",
  "183.102.104.107/32", "211.202.87.162/32", "111.223.124.240/32",
  "86.20.80.68/32", "213.197.141.157/32", "194.223.129.110/32", "27.125.163.200/32",
  "221.151.147.23/32", "3.13.128.64/32", "18.216.114.90/32",
  "195.99.166.98/32", "94.15.228.28/32", "2.26.194.79/32", "176.251.137.0/32",
  "220.88.137.166/32", "46.7.192.161/32", "118.218.202.124/32",
  "118.221.75.79/32", "194.223.135.82/32", "82.129.86.109/32",
  "217.111.142.154/32", "217.111.142.155/32", "217.111.142.156/30", "217.111.142.160/27", "217.111.142.192/26", "84.14.178.198/32", "121.138.225.225/32", "92.1.196.70/32", "81.144.170.237/32" # Unity IP
]
exception_ip_list2 = ["172.22.16.54/32", "3.22.61.220/32", "3.134.157.10/32", "3.132.72.71/32", "218.153.237.139/32",
  "122.32.130.96/32", "92.21.148.153/32",
  "165.243.5.20/32", "27.122.140.10/32",                                                               ## LGCNS NAT IP
  "211.36.236.126/32",                                                                                 ## BMETA NAT
  "211.40.58.126/32",                                                                                 ## BMETA NAT
  "88.109.14.138/32", "86.63.7.104/32", "217.138.62.235/32", "217.138.62.234/32", "89.241.180.168/32", # Unity IP
  "110.15.93.144/32", "211.201.153.17/32", "217.111.142.156/32",
  "218.144.101.154/32",                                                      # DevCra’s office (2F)
  "218.144.101.163/32",                                                      # DevCra’s office (3F)
  "220.85.201.38/32",                                                        #sejong park, sejong.park@lgcns.com
  "3.135.69.83/32", "3.135.132.141/32", "3.14.52.150/32", "3.135.58.212/32", ## load runner
  "3.136.136.224/32", "3.20.215.67/32", "3.21.3.213/32",                     ## what is this
  "118.37.113.185/32",                                                       ## Bellten (22/11/01 ~ 22/11/13)
  "39.124.180.120/32",                                                       ## JG (2022/11/08)
  "61.99.123.152/32",                                                        ## 김단아
  "175.192.136.110/32",                                                      ## 김진욱
  "222.233.215.146/32",                                                      ## 나혜정
  "121.141.1.192/32",                                                        ## Bibi
  "121.125.146.155/32",                                                      ## 배하늘
  "125.176.253.128/32",                                                      ## 이윤경
  "49.173.8.205/32",                                                         ## 박병훈
  "175.117.26.130/32",                                                       ## 이명진
  "211.202.128.16/32",                                                       ## 우병선
  "58.148.59.193/32",                                                        ## 임보혁
  "121.131.243.131/32"                                                       ## 박지연
]

exception_unity_ip_list = ["211.36.236.126/32"]

vpc_cidr = ["10.0.0.0/23", "10.0.2.0/25", "10.0.2.128/25"]

azs = ["us-east-2a", "us-east-2b"]

ingress_public_subnets        = ["10.0.0.0/26", "10.0.0.64/26"]
ingress_private_lb_subnets    = ["10.0.1.0/26", "10.0.1.64/26"]
ingress_private_app_subnets   = ["10.0.1.128/27", "10.0.1.160/27"]
ingress_private_inner_subnets = ["10.0.1.192/27", "10.0.1.224/27"]

egress_public_subnets        = ["10.0.2.0/27", "10.0.2.32/27"]
egress_private_inner_subnets = ["10.0.2.64/27", "10.0.2.96/27"]

inspection_private_nfw_subnets   = ["10.0.2.128/27", "10.0.2.160/27"]
inspection_private_inner_subnets = ["10.0.2.192/27", "10.0.2.224/27"]

fivetuple_stateful_rule_group      = []
domain_stateful_rule_group         = []
suricata_stateful_rule_group       = []
stateless_rule_group               = []
stateless_default_actions          = "forward_to_sfe"
stateless_fragment_default_actions = "forward_to_sfe"

s3_buckets = {
  cfnt-logs = {
    name = "cfnt-logs"
  }
}
